2022-2/projects/02.tex
% Created 2022-11-28 seg 19:58
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper, 11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[newfloat]{minted}
\usepackage[brazil, american]{babel}
\usepackage[utf8]{inputenc}
\usepackage{fancyhdr}
\usepackage[margin=1.2in]{geometry}
\usepackage[table, dvipsnames]{xcolor}
\usepackage{booktabs}
\usepackage{array}
\usepackage{enumitem}
\usepackage{datetime2}
\usepackage{tikz}
\usetikzlibrary{matrix, positioning}
\makeatletter
\DeclareRobustCommand*\course[1]{\gdef\@course{#1}}
\DeclareRobustCommand*\institution[1]{\gdef\@institution{#1}}
\DeclareRobustCommand*\semester[1]{\gdef\@semester{#1}}
\title{Trabalho Prático 2 - Sistema de Autenticação}
\author{Profs. Gleison Mendonça e Luigi Soares}
\course{Programação e Desenvolvimento de Software I}
\institution{DCC / ICEx / UFMG}
\semester{2022.2}
\let\thetitle\@title{}
\let\theauthor\@author{}
\let\thecourse\@course{}
\let\theinstitution\@institution{}
\let\thesemester\@semester{}
\let\thedate\@date{}
\makeatother
\DTMnewdatestyle{brDateStyle}{%
\renewcommand{\DTMdisplaydate}[4]{##3/##2/##1}%
\renewcommand{\DTMDisplaydate}{\DTMdisplaydate}}
\DTMsetdatestyle{brDateStyle}
\pagestyle{fancy}
\fancyhf{}
\setlength{\headheight}{15pt}
\lhead{\theauthor \\ \thecourse}
\rhead{\theinstitution \\ \thesemester}
\rfoot{\thepage}
\hypersetup{
colorlinks,
linkcolor={red!50!black},
citecolor={blue!50!black},
urlcolor={blue!80!black}
}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\begin{center}
\Large\bfseries\thetitle
\end{center}

Em uma cifra de César, cada caractere é deslocado da sua posição um número fixo
de lugares; por exemplo, considerando um deslocamento de 3, ``a'' torna-se ``d'',
``b'' torna-se ``e'', \ldots{}, ``z'' torna-se ``a'' (vamos considerar apenas caracteres
minúsculos de ``a'' até ``z'').  Para ilustrar, suponha que desejamos criptografar o
texto ``cruzeiro''. Para isso, vamos utilizar a cifra de César, considerando um
deslocamento de 3 caracteres:

\begin{center}
\begin{tabular}{rl}
Entrada: & \texttt{cruzeiro}\\\empty
Saída: & \texttt{fuxchlur}\\\empty
\end{tabular}
\end{center}

Note que ``z'' + 3 = ``c''. Como estamos considerando apenas caracteres de ``a'' até ``z'',
quando passamos do último caractere, retornamos para o ``a''. Isto é,

\begin{center}
z + 1 = a

z + 2 = b

z + 3 = c

...
\end{center}

A cifra de Vigenère é um método de criptografia que usa uma série de
diferentes cifras de César baseadas em letras de uma ``palavra-chava'' (\emph{key}).
Trata-se de uma versão simplificada de uma cifra de substituição
polialfabética mais geral, inventada por Leon Battista Alberti cerca de 1465.
Considere, por exemplo, que a chave a ser utilizada é ``key''. O alfabeto
possui 26 letras. Vamos considerar a letra ``a'' como sendo o deslocamento 0,
``b'' deslocamento 1, e assim por diante, até ``z'' como deslocamento 25. A
cifragem acontece da seguinte forma: deslocamos o primeiro caractere do texto
de entrada utilizando o primeiro caractere da palavra-chave (neste caso, ``k'',
que corresponde a um deslocamento de 10); em seguida, deslocamos o próximo
caractere utilizando o próximo caractere da palavra-chave (neste caso, ``e'',
deslocamento de 4); para o terceiro caractere, novamente movemos para o terceiro
caractere da chave (o caractere ``y'', deslocamento de 24); para o quarto
caractere, já esgotamos todos os caracteres da palavra-chave, então voltamos
para o primeiro (i.e. ``k'').  Para ilustrar, vamos criptografar o texto
``cruzeiro'' com a palavra-chave ``key'':

\begin{center}
\begin{tabular}{rl}
Entrada: & \texttt{cruzeiro}\\\empty
Saída: & \texttt{mvsjigbs}\\\empty
\end{tabular}
\end{center}

Note que para descriptografar a saída basta fazer o processo contrário.
Isto é, ao invés deslocar o caractere para a direita  o
deslocamos para a esquerda (de maneira circular).  Neste trabalho, vamos
armazenar pares de usuários e senhas, utilizando a cifra de Vigenère para
criptografar cada senha. Em seguida, iremos buscar por um determinado usuário e
senha, descriptografar a senha armazenada e comparar com a senha informada na
busca. É importante ressaltar que a estratégia utilizada neste exercício serve
apenas para fins educativos, não sendo adotada na prática. Você deve
seguir os seguintes passos:

\begin{enumerate}
\item Criar uma estrutura \texttt{Usuario} com campos \texttt{usuario} (string, representada
como um ponteiro para caracteres) e \texttt{senha} (string);
\item Criar uma estrutura \texttt{BancoDados} que contém um campo \texttt{n} (inteiro, a quantidade de usuários)
e um campo \texttt{usuarios} (um arranjo dinâmico de \texttt{n} usuários; ou seja, um ponteiro para \texttt{Usuario}).
\item Criar uma função \texttt{char *vignere(char *texto, char *chave)}, que
utiliza a cifra de Vignère para criptografar o \texttt{texto} utilizando como
palavra-chave o parâmetro \texttt{chave}. A função deve retornar uma string
(arranjo de char) contendo o texto cifrado.

\textbf{Dica 1}: Vamos trabalhar apenas com caracteres de ``a'' até ``z''. Logo, você pode
subtrair de cada caractere o caractere ``a'' (ou seja, o código ASCII de ``a''), para
obter códigos de 0 a 25 (``a'' = 0, ``b'' = 1, \ldots{}) e fazer as operações
necessárias. Lembre-se que, ao final das operações, você deve somar ``a''
novamente para obter o código ASCII correto do caractere criptografado.

\textbf{Dica 2:} Lembre-se que o deslocamento é \textbf{circular} (``z'' + 1 = ``a'') e que a utilização
da chave também é \textbf{circular} (ao esgotar todos os caracteres da chave, retornamos
ao primeiro e prosseguimos com o processo de cifragem).

\textbf{Dica 3}: Lembre-se que strings sempre terminam com o caractere \texttt{\textbackslash{}0}. Logo, você deve
garantir que a string retornada possua o caractere \texttt{\textbackslash{}0} indicando o final dela.

\textbf{Dica 4:} Você deverá alocar dinamicamente o arranjo a ser retornado
(\texttt{malloc} ou \texttt{calloc}). Note que o tamanho do texto cifrado é o mesmo que
o texto original. Você pode utilizar a função \texttt{strlen} (\texttt{string.h}) para
saber o tamanho do texto original (\texttt{strlen} não inclui o \texttt{\textbackslash{}0} no tamanho!).

\item Criar uma função \texttt{char *des\_vignere(char *cifrado, char *chave)}
que utiliza a cifra de Vignère para descriptografar o texto \texttt{cifrado}
utilizando como palavra-chave o parâmetro \texttt{chave}. A função deve retornar uma
string (arranjo de char) contendo o texto descriptografado
(as dicas anteriores valem para esta função).
\item Criar uma função \texttt{autenticar(Usuario u, BancoDados bd)} que percorre o
banco de dados procurando pelo usuário \texttt{u}.

\begin{enumerate}
\item Você deve fazer a busca pelo campo \texttt{u.usuario}, checando se este usuário
existe no banco de dados. Se este usuário não existe, retorne falso.
\item Caso o usuário seja encontrado, você deve descriptografar a senha armazenada
e comparar com a senha do usuário \texttt{u.senha}. Se forem iguais, retorne
verdadeiro; caso contrário, retorne falso.
\end{enumerate}

\textbf{Dica}: Para comparar strings, você pode utilizar a função \texttt{strcmp} da
 biblioteca \texttt{string.h} (se o resultado for zero, as strings são iguais).
\end{enumerate}

A entrada do exercício será composta de um inteiro \(n\), seguido de
\(n\) pares de usuários e senhas. Para cada par de usuário e senha,
será criado um elemento do tipo \texttt{Usuario} guardando o usuario lido e a
senha \textbf{criptografada}. A senha deverá ser criptografada utilizando como
chave o campo \texttt{usuario}. O programa irá imprimir a senha
criptografa e armazenar o \texttt{Usuario} no banco de dados. Depois, será lido
um segundo inteiro \(m\), seguido de \(m\) pares de usuários e senhas.
Para cada par, será criado um \texttt{Usuario} e o programa tentará autenticar
este usuário (utilizando a sua função \texttt{autenticar}). O programa irá
imprimir a mensagem ``Autenticação feita com sucesso!'' caso a senha
informada esteja correta ou ``Falha na autenticação!'' caso contrário. O
programa principal já estará preenchido e \textbf{não deve ser alterado}. Por
isso, atente-se aos nomes das funções, aos parâmetros e aos tipos de
retorno. De qualquer forma, encorajamos que leia o código do programa
principal e tente entender o que está sendo feito.

\bigskip
\textbf{Exemplo de execução do programa:}

\begin{center}
\begin{tabular}{ll}
\toprule
Entrada & Saída\\\empty
\midrule
2 & \\\empty
luigi cruzeiro & nlcfmtlw\\\empty
gleison vasco & blwkg\\\empty
2 & \\\empty
luigi cruzeiro & Autenticação feita com sucesso!\\\empty
gleison bahia & Falha na autenticação!\\\empty
\bottomrule
\end{tabular}
\end{center}

Para o primeiro Usuário --- campos \texttt{usuario}: luigi, \texttt{senha}: cruzeiro ---
a chave é ``luigi'', o texto a ser criptografado é ``senha'' e a saída
criptografada é ``nlcfmtlw''.
\end{document}